In [19]:
''' DATA AGGREGATION AND GROUPING'''

import pandas as pd
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [20]:
''' DATA AGGREGATING AND GROUPING'''
grouped_mean = df.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [21]:
grouped_sum = df.groupby(['Product','Region'])['Value'].sum()
grouped_sum

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [22]:
''' Multiple Aggregate Functions'''
grouped_agg = df.groupby('Region')['Value'].agg(['mean','sum','count','max'])
grouped_agg

             mean     sum  count   max
Region
East    42.307692   550.0     13  97.0
North   37.666667   339.0      9  71.0
South   62.000000   496.0      8  94.0
West    61.588235  1047.0     17  99.0

In [27]:
'''MERGING AND JOINING'''

df1 = pd.DataFrame({'Key':['A','B','C'],'Value1':[1,2,3]})
df2 = pd.DataFrame({'Key':['A','B','D'],'Value2':[4,3,6]})
df1
df2

#merging on key columns:
pd.merge(df1,df2,on='Key',how='inner')

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     3.0
2   C     3.0     NaN
3   D     NaN     6.0

In [29]:
pd.merge(df1,df2,on='Key',how='outer')

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     3.0
2   C     3.0     NaN
3   D     NaN     6.0

In [30]:
pd.merge(df1,df2,on='Key',how='left')

  Key  Value1  Value2
0   A       1     4.0
1   B       2     3.0
2   C       3     NaN

In [31]:
pd.merge(df1,df2,on='Key',how='right')

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       3
2   D     NaN       6